//1
// let a = +prompt("Введите число (чтоб было верно введите 0):"); 
// a == 0 ? alert("Верно") : alert("Неверно");

//2
// let a = +prompt("Введите число (чтоб было верно введите цифру больше 0):"); 
// a > 0 ? alert("Верно") : alert("Неверно");

//3
// let a = +prompt("Введите число (чтоб было верно введите цифру меньше 0):"); 
// a < 0 ? alert("Верно") : alert("Неверно");

//4
// let a = +prompt("Введите число (чтоб было верно введите цифру больше либо равную 0):"); 
// a >= 0 ? alert("Верно") : alert("Неверно");

//5
// let a = +prompt("Введите число (чтоб было верно введите цифру меньше либо равную 0):"); 
// a <= 0 ? alert("Верно") : alert("Неверно");

//6
// let a = +prompt("Введите число (чтоб было верно введите любую цифру не равную 0):"); 
// result = (a != 0) ? alert("Верно") : alert("Неверно");

//7
// let a = prompt("Введите число (чтоб было верно введите test):"); 
// a == "test" ? alert("Верно") : alert("Неверно");

//8
// let a = prompt("Введите число (чтоб было верно введите цифру 1):"); 
// a === "1" ? alert("Верно") : alert("Неверно");

//9
// let a = +prompt("Введите число (чтоб было верно введите цифру от 1 до 4 включительно):"); 
// a > 0 && a < 5 ? alert("Верно") : alert("Неверно");

//10
// let a = +prompt("Введите число");
// a==0 || a==2 ? alert(a+7) : alert(a/10);

//11
// let a = +prompt("Введите число a");
// let b = +prompt("Введите число b");

// a<=1 && b>=3 ? alert(a+b) : alert(a-b);

//12
// let a = +prompt("Введите число a");
// let b = +prompt("Введите число b");

// a>2 && a<11 || b>=6 && b<14 ? alert("Верно") : alert("Неверно");

//13
// const num = +prompt ("Введите число 1, 2, 3 или 4:")

// let result;

// switch (num) {
//     case 1: 
//     result = "Зима";
//     break;

//     case 2:
//     result = "Весна";
//     break;

//     case 3:
//     result = "Лето"
//     break;

//     case 4:
//     result = "Осень"
//     break;
  
//     default: alert ("Написано ввести от 1 до 4!!!!")
// } 

// alert(result);